security_on_rails/getting_started/lunchedin_fixed_manually/app/controllers/ratings_controller.rb

  def rate
    @venue = Venue.find(params[:id])
    unless @venue.has_user_rated?(session[:user_id])
      @venue.ratings << Rating.new do |r|
---
SELECT * FROM `venues` WHERE (`venues`.`id` = 1)
INSERT INTO `ratings` (`created_at`, `updated_at`, `venue_id`, `user_id`, `ratings_count`, `score`) VALUES('2010-11-26 21:37:34', '2010-11-26 21:37:34', 1, 6, NULL, 1)