basic_rails_examples/Examples1/app/controllers/filter_demos_controller.rb

  def show
    @filter_demo = FilterDemo.find(params[:id])
---
SELECT * FROM `filter_demos` WHERE (`filter_demos`.`id` = 953125641)

  def edit
    @filter_demo = FilterDemo.find(params[:id])
---
SELECT * FROM `filter_demos` WHERE (`filter_demos`.`id` = 953125641)

  def create
    @filter_demo = FilterDemo.new(params[:filter_demo])

    respond_to do |format|
      if @filter_demo.save
---
INSERT INTO `filter_demos` (`name`, `created_at`, `updated_at`) VALUES(NULL, '2009-10-06 19:48:27', '2009-10-06 19:48:27')

  def update
    @filter_demo = FilterDemo.find(params[:id])
---
SELECT * FROM `filter_demos` WHERE (`filter_demos`.`id` = 953125641)

  def destroy
    @filter_demo = FilterDemo.find(params[:id])
    @filter_demo.destroy
---
SELECT * FROM `filter_demos` WHERE (`filter_demos`.`id` = 953125641)
DELETE FROM `filter_demos` WHERE `id` = 953125641