capistrano_rails_working/depot/app/controllers/orders_controller.rb

SELECT COUNT(*) FROM `orders`
SELECT `orders`.* FROM `orders` ORDER BY created_at desc LIMIT 10 OFFSET 0
---
  def index
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',
      :per_page => 10

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 980190962 LIMIT 1
---
  def show
    @order = Order.find(params[:id])

SELECT COUNT(*) FROM `line_items` WHERE (`line_items`.cart_id = 980190967)
SELECT `line_items`.* FROM `line_items` WHERE (`line_items`.cart_id = 980190970)
---
  def new
    @cart = current_cart
    if @cart.line_items.empty?

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 980190962 LIMIT 1
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO `carts` (`updated_at`, `created_at`) VALUES ('2011-08-31 14:39:43', '2011-08-31 14:39:43')
INSERT INTO `orders` (`updated_at`, `pay_type`, `name`, `address`, `email`, `created_at`) VALUES ('2011-08-31 14:40:56', 'Credit card', 'John Ragan', '43151 Huntsman Square\r\nAshburn, VA 20148', 'john.ragan@gmail.com', '2011-08-31 14:40:56')
DELETE FROM `carts` WHERE `carts`.`id` = 980190967
SELECT `line_items`.* FROM `line_items` WHERE (`line_items`.order_id = 980190963)
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 980190962 LIMIT 1
---
  def update
    @order = Order.find(params[:id])

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 980190962 LIMIT 1
DELETE FROM `orders` WHERE `orders`.`id` = 980190962
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy