capistrano_rails_working/depot/app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY title
---
  def index
    @products = Product.all

SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 ORDER BY title LIMIT 1
---
  def show
    @product = Product.find(params[:id])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 ORDER BY title LIMIT 1
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO `products` (`description`, `created_at`, `image_url`, `price`, `updated_at`, `title`) VALUES ('<p>Here is shorter description for the book</p>', '2011-08-28 22:52:37', '/images/wd4d.jpg', 42.95, '2011-08-28 22:52:37', 'Web Design for Developers')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 ORDER BY title LIMIT 1
UPDATE `products` SET `updated_at` = '2011-09-01 00:34:38', `description` = 'Wibbles are fun!', `price` = 19.95, `image_url` = 'lorem.jpg', `title` = 'Lorem Ipsum' WHERE `products`.`id` = 980190962
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 ORDER BY title LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 980190962
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy

SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 ORDER BY title LIMIT 1
---
  def who_bought
    @product = Product.find(params[:id])