html5/offline_rails/app/controllers/manifests_controller.rb

  def index
    @manifests = Manifest.all
---
SELECT * FROM `manifests`